Revit 2027 API
Application.DefaultIFCProjectTemplate Property
 Full path to the default template file for new IFC project documents. It may be empty, in which case the DefaultProjectTemplate should be used.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string DefaultIFCProjectTemplate { get; }
Public ReadOnly Property DefaultIFCProjectTemplate As String
	Get
public:
property String^ DefaultIFCProjectTemplate {
	String^ get ();
}
member DefaultIFCProjectTemplate : string with get
Property Value
String
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace